package gr.aueb.cf.ch2;

/**
 * Προσθετει 2 ακεραιους και
 * εμφανιζει το αποτελεσμα στην κονσολα
 * (standard output).
 */
public class AddApp {
    public static void main(String[] args) {

        //Δηλωση και αρχικοποιηση μεταβλητων
        int num1 = 7;
        int num2 = 12;
        int result = 0;

        //Εντολες
        result = num1 + num2;

        //Εκτυπωση αποτελεσματων
        System.out.println("Το άθροισμα των " + num1 + " και " + num2 + " είναι: " + result);

        System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
    }
}

/**
 * Δηλωση και αρχικοποιηση σε 2 βήματα!
 * παραδειγμα:
 * int num1;
 * num1 = 7;
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 * System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 */


/**System.out.printf("Το άθροισμα των %d και %d είναι: %d", num1, num2, result);
 * εδω το printf εκτυπωνει στην οθονη χρησιμοποιώντας πιο
 * απλη δομη απο το println. --> χρησιμοποιειται
 */